cf/Documents/УстановкаНоменклатурыЗамены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаНоменклатурыЗамены</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НоменклатураЗамены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураЗамена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Партнеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/УстановкаНоменклатурыЗамены/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
														
	//|;
	//|ВЫБРАТЬ
	//|	Партнер
	//|ИЗ
	//|	Документ.УстановкаНоменклатурыЗамены
	//|ГДЕ
	//|	Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	|	ДатаНачала Период,
	|	Тов.Номенклатура,
	|	Тов.НоменклатураЗамена,
	|	Парт.Партнер,
	|	Парт.Контрагент,
	|	ИСТИНА Использование
	|ИЗ
	|	Документ.УстановкаНоменклатурыЗамены.Товары КАК Тов
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.УстановкаНоменклатурыЗамены.Партнеры  Парт
	|	ПО ИСТИНА
	|ГДЕ
	| Тов.Ссылка = &Ссылка И Парт.Ссылка = &Ссылка И ДатаНачала <> ДАТАВРЕМЯ(1,1,1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДатаОкончания Период,
	|	Тов.Номенклатура,
	|	Тов.НоменклатураЗамена,
	|	Парт.Партнер,
	|	Парт.Контрагент,
	|	ЛОЖЬ Использование
	|ИЗ
	|	Документ.УстановкаНоменклатурыЗамены.Товары КАК Тов
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.УстановкаНоменклатурыЗамены.Партнеры  Парт
	|	ПО ИСТИНА
	|ГДЕ
	| Тов.Ссылка = &Ссылка И Парт.Ссылка = &Ссылка И ДатаОкончания <> ДАТАВРЕМЯ(1,1,1)");
	
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	Запрос.УстановитьПараметр("Период",Ссылка.Дата);	
	Пакет = Запрос.ВыполнитьПакет();
		
	// Воткнем в структуру
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	//ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("НоменклатураЗамены", 			Пакет[1].Выгрузить());	
	
КонецПроцедуры
